Revit 2027 API
FabricationPartSizeMap.MappedWidthDiameter Property
 The mapped size for the width or diameter of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MappedWidthDiameter { get; set; }
Public Property MappedWidthDiameter As Double
	Get
	Set
public:
property double MappedWidthDiameter {
	double get ();
	void set (double value);
}
member MappedWidthDiameter : float with get, set
Property Value
Double
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace